; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	infrared2 - mode
	image0 - mode
	thermograph3 - mode
	image1 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 image1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
	(supports instrument2 image1)
	(supports instrument2 thermograph3)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite2 Planet7)
	(have_image Star5 thermograph3)
	(have_image Star6 image1)
	(have_image Planet8 thermograph3)
))

)

; plan
1. (turn_to satellite2 groundstation2 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation2)
   goals met: 0 of 5
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite2 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite2 planet8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 planet8)
   goals met: 0 of 5
5. (turn_to satellite1 planet7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet7)
   goals met: 1 of 5
6. (take_image satellite2 planet8 instrument2 thermograph3)
   added: (have_image planet8 thermograph3)
   goals met: 2 of 5
7. (turn_to satellite2 star5 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star5)
   goals met: 2 of 5
8. (take_image satellite2 star5 instrument2 thermograph3)
   added: (have_image star5 thermograph3)
   goals met: 3 of 5
9. (turn_to satellite2 star6 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star6)
   goals met: 3 of 5
10. (take_image satellite2 star6 instrument2 image1)
   added: (have_image star6 image1)
   goals met: 4 of 5
11. (turn_to satellite2 planet7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet7)
   goals met: 5 of 5
